app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = '3375012710060001'
---
public function proses_login()
{
    // Tangkap inputan form (mau itu NIS atau NIK masuknya ke sini)
    $id_login = trim((string)$this->request->getPost('id_login'));
    $password = trim((string)$this->request->getPost('password'));

    // Langsung tembak ke kolom 'username'
    $user = $this->db->table('users')->where('username', $id_login)->get()->getRowArray();