app/Controllers/Izin.php

SELECT *
FROM `izin`
ORDER BY `created_at` DESC
---
    public function rekap() {
        // Proteksi: Jika bukan guru, tendang balik ke form atau halaman login
        if (session()->get('role') !== 'guru') {
            return redirect()->to('/izin')->with('error', 'Akses ditolak!');
        }

        $data['izin'] = $this->izinModel->orderBy('created_at', 'DESC')->findAll();

INSERT INTO `izin` (`nis`, `nama`, `jenis_izin`, `alasan`, `jam_mulai`, `jam_selesai`, `status`) VALUES ('16359', 'Firdaus Azhar Ahnaf', 'Sakit', 'pusing2 jadinya alibaba', '1', '10', 'Proses')
---
   public function simpan()
    {
        // 1. Ambil data dari form
        $data = [
            'nis'       => $this->request->getPost('nis'),
            'nama'       => $this->request->getPost('nama'),
            'jenis_izin' => $this->request->getPost('jenis_izin'),
            'alasan'     => $this->request->getPost('alasan'),
            'jam_mulai'  => $this->request->getPost('jam_mulai'),
            'jam_selesai'=> $this->request->getPost('jam_selesai'),
            'status'     => 'Proses' // Status awal otomatis 'Proses'
        ];

        // 2. Simpan ke database via Model
        if ($this->izinModel->insert($data)) {

UPDATE `izin` SET `status` = 'Disetujui', `nama_guru` = 'Pak Firdaus Azhar Ahnaf'
WHERE `izin`.`id` IN ('23')
---
        public function update_status($id, $status)
{
    // Pastikan hanya guru yang bisa akses
    if (session()->get('role') !== 'guru') {
        return redirect()->to('/izin');
    }

    $this->izinModel->update($id, ['status' => $status]);

SELECT *
FROM `izin`
WHERE `nis` = '16359'
ORDER BY `id` DESC
---
public function status()
{
    $model = new IzinModel(); // Sesuaikan nama model

    // Asumsinya kamu menyimpan 'nis' siswa di session saat mereka login
    $nis_siswa = session()->get('nis');

    // Ambil data izin HANYA untuk siswa ini
    $data['izin'] = $model->where('nis', $nis_siswa)->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `izin`
WHERE `izin`.`id` = '22'
---
public function validasi($id)
{
    $model = new \App\Models\IzinModel();

    // Cari data izin berdasarkan ID yang ada di QR Code
    $data['izin'] = $model->find($id);